-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2018 年 05 月 17 日 04:47
-- 服务器版本: 5.5.53
-- PHP 版本: 5.4.45

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `kitchens`
--

-- --------------------------------------------------------

--
-- 表的结构 `commodity`
--

CREATE TABLE IF NOT EXISTS `commodity` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '商品ID',
  `com_name` text NOT NULL COMMENT '商品名字',
  `com_price` varchar(30) NOT NULL COMMENT '商品价格',
  `old_price` varchar(10) NOT NULL COMMENT '商品旧价格',
  `com_number` int(10) NOT NULL COMMENT '商品购买数量',
  `shop_name` text NOT NULL COMMENT '店铺名',
  `shop_sales` int(10) NOT NULL COMMENT '商品出售数量',
  `com_score` varchar(10) NOT NULL COMMENT '商品评分',
  `shop_total` int(10) NOT NULL COMMENT '出售总数',
  `com_img` text NOT NULL COMMENT '商品图片',
  `state` int(10) unsigned NOT NULL,
  `status` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='商品表' AUTO_INCREMENT=11 ;

--
-- 转存表中的数据 `commodity`
--

INSERT INTO `commodity` (`id`, `com_name`, `com_price`, `old_price`, `com_number`, `shop_name`, `shop_sales`, `com_score`, `shop_total`, `com_img`, `state`, `status`) VALUES
(1, 'joyclad乔克莱德 | 德国麦饭石不粘奶锅 平底锅16CM', '118', '159', 1, 'joyClad厨具', 12, '4.9', 337, './images/foodimg/guo.jpg', 0, '其他2款'),
(2, '黄山工坊 明前毛笋干 黄山工坊 明前毛笋干 黄山工坊 明前毛笋干', '24.9', '29.9', 1, '黄山工坊', 19, '4.9', 179, './images/foodimg/ms.jpg', 0, '其他2款'),
(3, '汉高厨房五金304不锈钢置物架壁挂双层调味架收纳沥水架刀具挂件', '89', '177', 1, '汉高家居旗舰店', 372, '4.9', 9006, './images/foodimg/sn.jpg', 0, '其他2款'),
(4, '欧派整体橱柜定做现代时尚咖啡时光开放式厨房装修石英石台面', '9999', '30000', 1, '欧派官方旗舰店', 34, '4.5', 9490, './images/foodimg/op.jpg', 0, '其他2款'),
(5, '吉百居厨房用品用具冰箱收纳架抽屉隔板层架塑料架子多功能置物架', '6', '12', 1, '吉百居家居旗舰店', 1913, '4.8', 15610, './images/foodimg/jz.jpg', 0, '其他2款'),
(6, '家用加厚超透亮无铅油壶厨房用品油壶酱油瓶醋瓶蜂蜜罐料酒瓶', '17.5', '35', 1, '雷汉玻璃制品厂', 3, '4.3', 873, './images/foodimg/pz.jpg', 0, '其他2款'),
(7, '免打孔锅盖架带接水盘壁挂厨房置物架多功能厨具用品挂件收纳架子', '18', '50', 1, '奥斯洁家居专营店', 152, '4.8', 1485, './images/foodimg/gg.jpg', 0, '其他2款'),
(8, '家居厨房用品用具小百货懒人神器日常居家生活日用品创意厨具实用', '7.7', '10', 1, '百屋居家', 89, '4.7', 99, './images/foodimg/ry.jpg', 0, '其他2款'),
(9, '装米桶储米箱防虫防潮家用加厚透明塑料日本自动计量12KG厨房米缸', '62.9', '139.8', 1, '傲家家居旗舰店', 84, '4.8', 293, './images/foodimg/sl.jpg', 0, '其他2款'),
(10, '正品王麻子家用菜刀锋利厨师刀切肉切菜复合钢老式手工铁刀切片刀', '18', '56', 1, '梦想生活厨具百货', 671, '4.6', 13745, './images/foodimg/cd.jpg', 0, '其他2款');

-- --------------------------------------------------------

--
-- 表的结构 `food_data`
--

CREATE TABLE IF NOT EXISTS `food_data` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '食物材料Id编号',
  `food_time` int(12) unsigned NOT NULL COMMENT '时间戳',
  `user_tel` varchar(12) NOT NULL COMMENT '作者电话号码',
  `food_stuff` text NOT NULL COMMENT '材料名',
  `food_number` text NOT NULL COMMENT '材料数量',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='食物材料表' AUTO_INCREMENT=38 ;

--
-- 转存表中的数据 `food_data`
--

INSERT INTO `food_data` (`id`, `food_time`, `user_tel`, `food_stuff`, `food_number`) VALUES
(1, 1525504116, '12144836471', '牛排', '若干'),
(2, 1525504116, '12144836471', '盐', '若干'),
(3, 1525504116, '12144836471', '黑胡椒粉', '若干'),
(4, 1525504116, '12144836471', '油', '若干'),
(5, 1525504116, '12144836471', '黄油', '可选'),
(6, 1525504116, '12144836471', '红酒', '可选'),
(7, 1525504117, '12144836471', '排骨', '（约700g）'),
(8, 1525504117, '12144836471', '莲藕', '2节'),
(9, 1525504117, '12144836471', '生姜', '1块'),
(10, 1525676916, '15767378466', '高筋面粉', '150克'),
(11, 1525676916, '15767378466', '牛奶', '80克'),
(12, 1525676916, '15767378466', '鸡蛋', '一个'),
(13, 1525676916, '15767378466', '酵母', '3克'),
(14, 1525676916, '15767378466', '盐', '2克'),
(15, 1525676916, '15767378466', '糖', '10克'),
(16, 1525676916, '15767378466', '火腿片', '四片'),
(17, 1525676917, '15767378466', '黄油', '75克'),
(18, 1525676917, '15767378466', '糖粉', '65克'),
(19, 1525676917, '15767378466', '鸡蛋', '1个'),
(20, 1525676917, '15767378466', '玉米油', '30克'),
(21, 1525676917, '15767378466', '低筋面粉', '160克 或130比较酥脆'),
(22, 1525676917, '15767378466', '盐', '0.5克'),
(23, 1525590516, '13754687924', '土豆', '随意'),
(24, 1525590516, '13754687924', '豆瓣酱', '适量'),
(25, 1525590516, '13754687924', '葱花', '适量'),
(26, 1525590516, '13754687924', '盐', '适量'),
(27, 1525590516, '13754687924', '酱油', '适量'),
(28, 1525590516, '13754687924', '蒜', '适量'),
(29, 1525590516, '13754687924', '辣椒面', '适量'),
(30, 1525590517, '13754687924', '猪肉', ''),
(31, 1525590517, '13754687924', '时令鲜蔬', '如豆芽、白菜、莴笋、土豆、菌菇类'),
(32, 1525590517, '13754687924', '淀粉', '豌豆粉'),
(33, 1525590517, '13754687924', '豆瓣酱', ''),
(34, 1525590517, '13754687924', '干辣椒面', ''),
(35, 1525590517, '13754687924', '花椒', ''),
(36, 1525590517, '13754687924', '姜', ''),
(37, 1525590517, '13754687924', '鸡蛋', '只取蛋清');

-- --------------------------------------------------------

--
-- 表的结构 `food_step`
--

CREATE TABLE IF NOT EXISTS `food_step` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '步骤表编号',
  `food_time` int(12) unsigned NOT NULL COMMENT '时间戳',
  `user_tel` varchar(11) NOT NULL COMMENT '作者电话号码',
  `food_move` text NOT NULL COMMENT '步骤说明',
  `food_move_img` text COMMENT '步骤图片地址',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='食物步骤表' AUTO_INCREMENT=42 ;

--
-- 转存表中的数据 `food_step`
--

INSERT INTO `food_step` (`id`, `food_time`, `user_tel`, `food_move`, `food_move_img`) VALUES
(1, 1525504116, '12144836471', '超市里买好一点的牛排，注意不要买腿肉或腱子。我推荐眼肉，肥一点的好吃。初学者也不要买T骨之类带骨头的，不容易做。不需要太贵的，美国这边5刀一磅的已经很好了，10刀的可以熟练后再买。贵一点的确实好吃', NULL),
(2, 1525504116, '12144836471', '拿刀背把牛肉断筋。随便敲就好了，这步不是重点，敲薄了容易熟，而且感觉更大啊哈哈', './images/foodimg/np1.jpg'),
(3, 1525504116, '12144836471', '腌制：牛排上洒盐、黑胡椒粉、抹上油，腌制一小时或以上', NULL),
(4, 1525504116, '12144836471', '腌制后的牛排，表面油光发亮，可以入锅了', './images/foodimg/np2.jpg'),
(5, 1525504116, '12144836471', '平底锅烧热，直接入牛排', NULL),
(6, 1525504116, '12144836471', '一面煎完换一面，翻一次就够了，不用翻来翻去。时间要自己把握了，大火1分钟左右，或者表面有焦黑了就可以翻。\r\n（也有大师说每15秒翻一次，来回翻直到内部熟。这种事总有不同做法，看各人喜好吧。）', NULL),
(7, 1525504116, '12144836471', '关火，趁着锅里的余温加最后的调料：一小勺红酒，或者一小块黄油，倒一点点生抽也可以。这里可以自由发挥了。\r\n\r\n重要：静置5分钟享用', './images/foodimg/np3.jpg'),
(8, 1525504116, '12144836471', '补充：很多人提到了“铸铁条纹锅”。经常做牛排的话确实可以入手一个，你值得拥有。不过这玩意儿除了牛排也没别的用了。。。', './images/foodimg/np4.jpg'),
(9, 1525504117, '12144836471', '生姜刷干净，去皮，切片。将生姜皮和排骨一起下入清水锅中，煮开后继续煮三四分钟，将排骨捞起沥干，水和姜皮就倒掉不用了', './images/foodimg/pg1.jpg'),
(10, 1525504117, '12144836471', '将焯过水的排骨和生姜片放进砂锅煲中，加入足够量的清水，水量要没过排骨还略高1cm左右。——因为煲汤的过程中会流失掉一小部分水分，所以水要一次加足', './images/foodimg/pg2.jpg'),
(11, 1525504117, '12144836471', '烧开后加盖转小火炖1小时左右', './images/foodimg/pg3.jpg'),
(12, 1525504117, '12144836471', '莲藕去皮，切滚刀块，撒上少许盐，杀一下——也就是用盐拌匀，腌10分钟左右', './images/foodimg/pg4.jpg'),
(13, 1525504117, '12144836471', '将莲藕下入汤煲中，继续小火炖1小时', './images/foodimg/pg5.jpg'),
(14, 1525504117, '12144836471', '肉烂藕粉之时，加适量盐，转中火滚开煮10分钟左右，撒上葱花即可', './images/foodimg/pg6.jpg'),
(15, 1525676916, '15767378466', '除火腿肠以上所有材料混合揉至光滑面团', './images/foodimg/mb1.jpg'),
(16, 1525676916, '15767378466', '盖上保鲜膜，发酵至两倍大小', './images/foodimg/mb2.jpg'),
(17, 1525676916, '15767378466', '发酵好的面团均匀分成4等分', './images/foodimg/mb3.jpg'),
(18, 1525676916, '15767378466', '火腿肠切成圆片', './images/foodimg/mb4.jpg'),
(19, 1525676916, '15767378466', '把火腿肠圆片包进面团里面', './images/foodimg/mb5.jpg'),
(20, 1525676916, '15767378466', '醒发五分钟后，锅里倒油小火两面煎成金黄色，然后用锅盖小火闷30秒', './images/foodimg/mb6.jpg'),
(21, 1525676916, '15767378466', '趁热开吃吧！我反正吃了两个！是不是很简单快手？特别是夏天一个小时之类就可以吃到香喷喷的黄金煎包！', './images/foodimg/mb7.jpg'),
(22, 1525676917, '15767378466', '黄油切小块软化  夏天就室温软化 冬天可以微波炉叮30秒左右。软化就可以 不要化成水', './images/foodimg/qq1.jpg'),
(23, 1525676917, '15767378466', '加入糖粉 充分打发  打发到发白 黄油变很轻盈 纹路像一片片羽毛一样', NULL),
(24, 1525676917, '15767378466', '接着加入鸡蛋液 可以分次加入 一档打发 充分打发哦 刚开始会油水分离 慢慢吸收了就会很光滑  要耐心哦 ', NULL),
(25, 1525676917, '15767378466', '接着加入盐和玉米油1挡打发 一定要充分', NULL),
(26, 1525676917, '15767378466', '完成后 加入过筛后的低筋面粉  用打蛋器先手动搅拌一下 免得面粉满天飞   \n然后开启打蛋器一档  搅拌均匀就停下    不要用刮刀压   \n装入裱花袋 就可以挤出各种形状    \n也可以用刮刀切拌 翻拌 怎么方便怎么来就行 就是不要压它就可以 混合看不见白色的干粉就可以了 ', NULL),
(27, 1525676917, '15767378466', '每个人的烤箱不同 温度也不同。我的是180度上火  140度下火 亲们请根据自己的烤箱做调整哦。\n 直到曲奇上色均匀 边缘金黄色就可以  不要关注时间  主要看上色', NULL),
(28, 1525676917, '15767378466', '180上火  140度下火  15到20分钟\n直到上色均匀 边缘金黄就可以出炉  不要在意时间  看上色出炉  烤到喜欢的颜色就可以出炉了    没有上下火的 165度  烤 直到上色  一定要看住哦  请根据自己家得烤箱调节温度', './images/foodimg/qq2.jpg'),
(29, 1525676917, '15767378466', '漂亮不 快来试试    想要更加酥脆 可以减少30克面粉  不过本人还是觉得160克的好吃', './images/foodimg/qq3.jpg'),
(30, 1525590516, '13754687924', '土豆削皮洗净', './images/foodimg/td1.jpg'),
(31, 1525590516, '13754687924', '切成均匀的片，不要太薄噢', './images/foodimg/td2.jpg'),
(32, 1525590516, '13754687924', '锅里放水，水烧开以后把土豆片放进去烫一下，二十秒左右就可以了，烫久了做的时候容易烂掉，不烫也做不好', './images/foodimg/td3.jpg'),
(33, 1525590516, '13754687924', '锅里放油，把土豆片两面煎黄备用', './images/foodimg/td4.jpg'),
(34, 1525590516, '13754687924', '锅里加油烧热后，放蒜片，豆瓣酱适量，还可以放点花椒粒炒香', './images/foodimg/td5.jpg'),
(35, 1525590516, '13754687924', '\n把煎黄的土豆片倒进去翻均匀，撒上适量辣椒面翻匀，然后装干锅，撒葱花白芝麻，点上酒精炉即可', './images/foodimg/td6.jpg'),
(36, 1525590517, '13754687924', '姜分两半一半切片，一半切末待用。猪肉切薄片加入盐、花椒、姜末，淀粉、蛋清拌匀腌制待用。一个盆子待用（用来装菜的）', NULL),
(37, 1525590517, '13754687924', '其他蔬菜按照菜性采取相应措施，例如豆芽一烫就熟直接铺盆底就好。像莴笋土豆这些根茎类的就切片待用，菌菇、蔬叶类的就手撕成片条待用', NULL),
(38, 1525590517, '13754687924', '锅内入少量油烧热，入盐、较易熟的菜品（譬如：白菜、莴笋叶神马的）略炒断生出锅铺到盆子里', NULL),
(39, 1525590517, '13754687924', '锅内再入油烧热，入豆瓣、姜片小火慢炒至油红旺旺的并且飘出香味儿，入水预估能没过所有食材的量', NULL),
(40, 1525590517, '13754687924', '转大火煮沸后下入需要煮的菜品，煮至蔬菜成熟水沸状态入肉片煮30s-60s果断关火装盆撒干辣椒面、花椒粒', NULL),
(41, 1525590517, '13754687924', '锅入油，大火烧旺关火，将锅内旺油均匀浇洒在菜盆内，搞定了就开吃(ˉ﹃ˉ)', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `food_works`
--

CREATE TABLE IF NOT EXISTS `food_works` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '作品表ID',
  `works_tel` varchar(12) NOT NULL COMMENT '作者电话号码',
  `works_time` varchar(12) NOT NULL COMMENT '作品时间戳',
  `works_type` int(10) unsigned NOT NULL COMMENT '作品类型：1菜谱，2菜单作品',
  `food_name` text NOT NULL COMMENT '食物名字',
  `food_img` text NOT NULL COMMENT '食物图片',
  `food_peopel` int(12) unsigned NOT NULL COMMENT '做这食物人数',
  `food_type` int(12) unsigned NOT NULL COMMENT '食物类型',
  `food_score` varchar(10) NOT NULL COMMENT '食物评分',
  `food_text` text NOT NULL COMMENT '食物故事',
  `food_tips` text NOT NULL COMMENT '小贴士',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='用户作品表，中间键' AUTO_INCREMENT=11 ;

--
-- 转存表中的数据 `food_works`
--

INSERT INTO `food_works` (`id`, `works_tel`, `works_time`, `works_type`, `food_name`, `food_img`, `food_peopel`, `food_type`, `food_score`, `food_text`, `food_tips`) VALUES
(1, '12144836471', '1525504116', 1, '顶级牛排', './images/foodimg/np.jpg', 6423, 4, '8.2', '做牛排的菜谱数不胜数，但照我看很多菜谱都有问题，所以做出来的牛排总感觉差了点儿什么。今天要说的这个做法是本人来美国之后持续研究4年，期间请教各路人士、尝试各种做法，最终才总结出来的集大成者。不敢夸口，但完爆一下friendly''s啊，applebee啊之类的连锁店绝对没有问题。高手可以跳过步骤直接看小贴士部分，纠正了几个容易犯的错误。\n\n另外强调一下，本菜谱当然是家常做法，重在简单、易操作，和专业的做法肯定有出入，因为家里也不具备专业厨房的条件。所以挑刺的朋友请嘴下留情。', '重点提示1：腌制过程绝对不可以加液体调料，酒、酱油什么不能加，因为液体会降低温度，且遇油会爆，破坏肉质。这就相当于炒菜之前要沥干水分一样，水分越少越好。我以前就是不懂这一点，用红酒腌牛排，做出来一塌糊涂\n\n重点提示2：为什么要在牛排上淋油，因为油渗入到牛排里，煎的时候油会一起加热，容易熟。这就相当于东北锅包肉需要炸两次，一个道理。这是非常容易忽略的一点\n\n重点提示3：锅里不需要另外放油。锅里加油的话，油温和牛排温度不一致，反而容易焦。\n\n重点提示4： 如果不喜欢内部有血水的，可以趁热入微波炉，30秒。微波炉是从内而外加热，正好弥补！另外牛排必须吃热的，我通常吃着吃着冷掉了也会热微波炉。\n\n总结这个做法的关键就是牛排抹油腌，锅里不放油。只要掌握好时间，上手轻松谁都能学。\n\n————————————————————————\n一次性回答众多留言问题：\n\n很多人说牛肉太老咬不动，我提供一个简单的检验方法。\n如果做完了中间层仍旧是血红的（意味着7成熟以下），那么意味着火候就过关了。\n如果火候过关了还是咬不动，那么意味着————你买的牛排不行\n\n牛排好不好吃，7成是原料本身，2成是做法，1成是经验。所以本菜谱只起到2成的作用，而且顺着步骤做下来基本错不了。但如果食材买的不好，那实在是神仙也帮不了你啊。\n\n—————————————————————————\n最后声明：\n我强调了很多次了，本做法重在简单、易操作，重在告诉你新手也能掌握的方法。比如说最后微波炉30秒弥补不熟，偏有人说用微波炉就是低端。你那么高端你怎么还来找菜谱？微服私访吗？\n\n有人闲得蛋疼喜欢到处挑刺，什么一流厨师不是这么做的。废话，家常和专业的当然不一样，问题是专业的你学的会吗？人家看一眼就知道几成熟，人家一口锅就几百美刀，你行吗？不行你废什么话。又没人逼你看。\n\n言尽于此，喷子自重。'),
(2, '12144836471', '1525504117', 2, '排骨莲藕汤', './images/foodimg/pg.jpg', 4188, 1, '8.1', '排骨藕汤跟热干面一样，差不多是湖北人的一个情结了。如果你问生活在异乡的湖北人，最想念家乡的什么？我想，多半会回答：藕啊。 \n湖北的藕确实好吃，花样也多，藕圆子，藕夹，卤藕，干煸藕丝，清炒藕带，还有排骨藕汤。排骨藕汤应该是湖北人家最普遍，最喜欢煨的汤了——对，在我们湖北，都说“煨汤”，不说炖汤或煲汤的。 \n煨汤，要用“吊子”，蜂窝煤炉子。 \n“吊子”是指的煨汤的瓦罐，汤罐，老一辈儿人都这么叫。以前煨汤都是蜂窝煤炉子，把吊子放在炉子上，封住炉子下部的风口，小火慢慢“煨”，煨到肉烂藕粉汤浓。现在家家户户都用煤气或天然气，除了做早点生意的，蜂窝煤炉子几乎是看不见了，连那拖着板车卖煤的人也很少见。 \n去湖北的集市上买藕，也很有趣。你往那卖藕的摊前一站，你还没说话呢，那卖藕的摊主就先招呼上了：“您家是煨汤啊，还是炒得吃？”然后，就根据你说的用途，给你不同的藕——在湖北，真的就分“煨汤的藕”和“炒着吃的藕”，也许不是所有卖藕的摊主都这样做，但至少在我的印象中，儿时也好，长大之后也好，跟着妈妈去菜场，听见的都是这样的对白。 \n只是普通的排骨，寻常的藕，和着几片姜，但经过妈妈们的手，就能变出一碗清甜香浓，喝完唇齿留香的好汤。乡愁，什么是乡愁？当我们离开家，那原本如呼吸一样平常的生活点滴，柴米油盐的家常味道，就成了挥不去的的乡愁。', '湖北的土法煨汤，排骨是不焯水的，只是将排骨浸泡，反复换水以去掉血水。去血水后的排骨在锅里炒香，再放进汤罐子里煨。至于放藕的时机，也没有定法，喜欢吃粉藕的就早一点下藕，喜欢脆一点口感的就晚一点下。'),
(3, '15767378466', '1525676916', 1, '黄金火腿包', './images/foodimg/mb.jpg', 10, 6, '9.1', '超快手不用烤也能吃到好吃到爆的面包', '如果喜欢其他口味的内陷，可随意更改！'),
(4, '15767378466', '1525676917', 2, '香酥曲奇', './images/foodimg/qq.jpg', 3378, 3, '8.1', '到今天为止最好吃的曲奇  没有之一    好挤 一次性裱花袋子都可以搞定哦  喜欢我的可以加我一起研究哦', '一定要打发足够  发白  呈轻盈 蓬松得样子在加鸡蛋  一定要充分混合  全程打蛋器一档 即可'),
(5, '13754687924', '1525590516', 1, '干锅土豆片', './images/foodimg/td.jpg', 2633, 1, '7.6', '说点什么呢，两个字，好吃！', '说点什么呢，两个字，好吃！'),
(6, '13754687924', '1525590517', 2, '水煮肉片', './images/foodimg/rp.jpg', 3211, 2, '8.0', '第一次吃水煮肉片是很小的时候 那时候只知道 哇 肿么会有这么好吃的菜 对胃口 够麻辣 色香味俱全~\\(≧▽≦)/~\n\n渐渐的饭店里也都有这个菜了 心里那阵小欢喜哦 不管什么时候 不管大人的反对 这个菜已经成为必点菜!\n\n再后来慢慢大了 虽然还是很爱吃这道菜 但是已经开始觉得在饭店吃很不划算了!肉片没有多少 底下配菜一堆 最主要的是价格飞涨...\n\n于是再也忍不了了 终于决定自己做 这样省钱不说 最主要的是干净卫生 还可以多放点肉肉哦!', '1.我不喜欢白色的肉 所以加老抽 大家看自己喜好 也可不加\n\n2.焯菜的水不要太混 焯过两种 最好倒了换水\n\n3.焯过肉的水一定倒掉 除了有血水外 还有大量淀粉 不适合做汤\n\n4.至于为什么要加豆腐皮 我想一个是我个人喜好 再就是女生大部分都是喜欢的吧\n\n5.大家也可以加入豆芽等喜欢的菜菜哦~\\(≧▽≦)/~'),
(7, '15767378465', '1525763316', 1, '鸡蛋小饼干', './images/foodimg/jd.jpg', 3780, 3, '8.3', '选在大半夜发菜谱居然是因为我饿了。爬起来吃了几颗鸡蛋小饼干，然后就越吃越好吃，越吃越来劲了。\n真的就是虽然及其普通但一吃就停不了嘴呀。老少通吃。\n吃在嘴里就觉得：咦～这味道。是记忆深处小时候常吃的饼干的味道。', '一定一定要留有空隙 不然会粘到一起。另外这个配方一丁点也不稀。是非常浓稠略有流动性的面糊。如果你烤出来摊成了一大片 那么先检查一下你的蛋液是否打发到位了。'),
(8, '15767378465', '1525763317', 2, '可乐鸡翅', './images/foodimg/kl.jpg', 19465, 4, '8.1', '老少咸宜，简单好上手，几分钟就可以搞定~ ', '鸡翅是不需要改刀划口  不需要腌制的。也不用加料酒等去腥味的调料。新鲜的鸡肉本身的味道一点都不会腥。加上可乐煮过是不会有异味的。 \n\n按照我这个图片用量这个口感稍甜！！！！！如果很怕太甜的话，建议减少用量，即不用漫过整个鸡翅高度差不多就是最多一半，但是要勤翻动翻动。浮沫还是要捞。      \n水收干点好吃哦~ '),
(9, '15767378464', '1525849716', 1, '鲜香韭菜盒子', './images/foodimg/fc.jpg', 5461, 5, '8.5', '韭菜最爱吃，味道浓郁，营养丰富，无论怎么吃，都喜欢，韭菜盒子更是家常便饭，隔三岔五就做。', '1. 和面的水一定要在80度至90度左右。\n2. 韭菜一定要晾干水份，切碎后先拌油，然后再加其它调料，这一步很重要。'),
(10, '15767378464', '1525849717', 2, '早餐鸡蛋饼', './images/foodimg/jdb.jpg', 1697, 6, '8.2', '早饭是个大难题，因为起不来……一直喜欢小摊上卖的鸡蛋饼，香香的，裹着甜面酱和香菜，超满足～后来开始流行地沟油和各种过期材质，唉，只能自己做了。', '成品饼子不是那种脆脆的口感，略厚实。如果喜欢香脆口感，需把面糊调得更稀，油的用量也要加大，个人不是很喜欢。');

-- --------------------------------------------------------

--
-- 表的结构 `goods_cart`
--

CREATE TABLE IF NOT EXISTS `goods_cart` (
  `id` int(20) NOT NULL AUTO_INCREMENT COMMENT '购物车id',
  `com_name` varchar(40) NOT NULL COMMENT '商品名',
  `com_price` int(20) NOT NULL COMMENT '商品单价',
  `com_img` varchar(60) NOT NULL COMMENT '商品图片',
  `all_price` int(11) NOT NULL COMMENT '商品总价',
  `com_number` int(11) NOT NULL COMMENT '商品数量',
  `user_id` int(20) NOT NULL COMMENT '用户id',
  `goods_id` int(20) NOT NULL COMMENT '商品id',
  `buer2` varchar(10) NOT NULL DEFAULT 'true',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=68 ;

--
-- 转存表中的数据 `goods_cart`
--

INSERT INTO `goods_cart` (`id`, `com_name`, `com_price`, `com_img`, `all_price`, `com_number`, `user_id`, `goods_id`, `buer2`) VALUES
(1, '会计师快递费就是对你负责公交卡水电费是你点击', 22, 'images/img34316092acdef8.png', 68, 1, 1, 1, 'true'),
(2, '路口见对方可能对方即可代付款你刚才电脑和法国', 69, 'images/img34616092b2d650.png', 69, 1, 1, 2, 'true'),
(66, 'joyclad乔克莱德 | 德国麦饭石不粘奶锅 平底锅16CM', 118, './images/foodimg/guo.jpg', 0, 9, 0, 0, 'true'),
(67, '黄山工坊 明前毛笋干 黄山工坊 明前毛笋干 ', 25, './images/foodimg/ms.jpg', 0, 2, 0, 0, 'true');

-- --------------------------------------------------------

--
-- 表的结构 `kit_user`
--

CREATE TABLE IF NOT EXISTS `kit_user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `user_phone` varchar(11) NOT NULL COMMENT '用户手机号码',
  `user_email` text NOT NULL COMMENT '用户邮箱地址',
  `user_name` text NOT NULL COMMENT '用户昵称',
  `user_password` varchar(32) NOT NULL COMMENT '用户密码',
  `user_sex` int(3) NOT NULL COMMENT '性别（0为女，1为男）',
  `user_follow` int(10) NOT NULL COMMENT '关注',
  `user_fans` int(10) NOT NULL COMMENT '粉丝',
  `user_img` varchar(100) NOT NULL DEFAULT './images/shiwu3.jpg' COMMENT '头像',
  `user_time` date NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_phone` (`user_phone`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8mb4 COMMENT='密码在写入的时候就用MD5加密  手机，邮箱和名字用正则判断一下' AUTO_INCREMENT=20 ;

--
-- 转存表中的数据 `kit_user`
--

INSERT INTO `kit_user` (`id`, `user_phone`, `user_email`, `user_name`, `user_password`, `user_sex`, `user_follow`, `user_fans`, `user_img`, `user_time`) VALUES
(1, '12144836471', '123456@qq.com', 'Alex', 'f379eaf3c831b04de153469d1bec345e', 0, 40, 40, './images/users/user5.jpg', '2018-05-05'),
(2, '13754687924', '1324865@163.com', 'ben', 'f379eaf3c831b04de153469d1bec345e', 1, 20, 30, './images/users/user6.jpg', '2018-05-06'),
(3, '15767378466', '670908592@qq.com', '小泽', 'f379eaf3c831b04de153469d1bec345e', 1, 1, 999, './images/users/user7.jpg', '2018-05-07'),
(4, '15767378465', '13248651@163.com', '小新', 'f379eaf3c831b04de153469d1bec345e', 1, 33, 111, './images/users/user8.jpg', '2018-05-08'),
(5, '15767378464', '13248652@163.com', '小伟', 'f379eaf3c831b04de153469d1bec345e', 1, 36, 222, './images/users/user9.jpg', '2018-05-09'),
(6, '15767378463', '13248653@163.com', '国大', 'f379eaf3c831b04de153469d1bec345e', 1, 38, 333, './images/users/user10.jpg', '2018-05-10'),
(7, '15767378462', '13248654@163.com', '小梅', 'f379eaf3c831b04de153469d1bec345e', 1, 39, 555, './images/users/user11.jpg', '2018-05-11'),
(8, '15767378461', '13248655@163.com', '小明', 'f379eaf3c831b04de153469d1bec345e', 1, 66, 666, './images/users/user12.jpg', '2018-05-12'),
(9, '15767378444', '132486544@163.com', '奥巴牛', 'f379eaf3c831b04de153469d1bec345e', 0, 99, 444, './images/users/user13.jpg', '2018-05-13'),
(10, '12342341234', '13248494@163.com', '特朗普', 'f379eaf3c831b04de153469d1bec345e', 0, 99, 777, './images/users/user14.jpg', '2018-05-14'),
(11, '13106959775', '361146992@qq.com', 'blue', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/users/user14.jpg', '0000-00-00'),
(12, '15162621431', '123456@qq.com', '八级大狂风', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/users/user14.jpg', '0000-00-00'),
(13, '13111111111', '8546852@qq.com', '大橙子', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/users/user14.jpg', '0000-00-00'),
(14, '15767378666', '666@qq.com', '666', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/users/user14.jpg', '0000-00-00'),
(15, '13160528993', '222222@qq.com', 'goodboy', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/shiwu3.jpg', '0000-00-00'),
(16, '13160528994', '22222@qq.com', 'qweqwer', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/shiwu3.jpg', '0000-00-00'),
(17, '15666666666', '987@qq.com', '啊啊啊啊', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/shiwu3.jpg', '0000-00-00'),
(18, '13106959775', '6666@qq.com', 'laskj', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/shiwu3.jpg', '0000-00-00'),
(19, '13106959776', '65489@qq.com', 'poqwiep', 'f379eaf3c831b04de153469d1bec345e', 0, 0, 0, './images/shiwu3.jpg', '0000-00-00');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
